Repository: Basca4ril/lehae-backend
Catalog: locale/st/LC_MESSAGES/django.po
Languages: st

source: Registration failed.
st: Ngoliso e hlōleha.

source: Username may be taken.
st: Lebitso la mosebelisi le ka nkuoa.

source: Email may be taken.
st: Imeile e ka nkuoa.

source: Hello
st: Lumela

source: You have received a new enquiry for your property
st: U fumane patlisiso e ncha bakeng sa setša sa hau

source: in
st: ho

source: From
st: Ho tsoa ho

source: Message
st: Molaetsa

source: Please respond directly to the tenant
st: Ka kopo araba mohiri ka kotloloho

source: Message sent successfully.
st: Molaetsa o rometsoe ka katleho!

source: Failed to send message.
st: Ho hlōleha ho romela molaetsa.

source: Invalid or missing property ID.
st: Property ID e haelloa.

source: Property ID required.
st: Property ID ea hlokahala.

source: Property already favorited.
st: Setša se se se ratoa.

source: Favorite not found.
st: Setša se ratoang ha se fumanehe.
